cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71J20B.svd
            <register>
               <name>GMAC_SCH</name>
               <description>1588 Timer Second Comparison High Register</description>
               <addressOffset>0x0E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_EFTSH</name>
               <description>PTP Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0x0E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_EFRSH</name>
               <description>PTP Event Frame Received Seconds High Register</description>
               <addressOffset>0x0EC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PEFTSH</name>
               <description>PTP Peer Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0x0F0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PEFRSH</name>
               <description>PTP Peer Event Frame Received Seconds High Register</description>
               <addressOffset>0x0F4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_MID</name>
               <description>Module ID Register</description>
               <addressOffset>0x0FC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MREV</name>
                     <description>Module Revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MID</name>
                     <description>Module Identification Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_OTLO</name>
               <description>Octets Transmitted Low Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_OTHI</name>
               <description>Octets Transmitted High Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_FT</name>
               <description>Frames Transmitted Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FTX</name>
                     <description>Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_BCFT</name>
               <description>Broadcast Frames Transmitted Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BFTX</name>
                     <description>Broadcast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_MFT</name>
               <description>Multicast Frames Transmitted Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFTX</name>
                     <description>Multicast Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PFT</name>
               <description>Pause Frames Transmitted Register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PFTX</name>
                     <description>Pause Frames Transmitted Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_BFT64</name>
               <description>64 Byte Frames Transmitted Register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>64 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFT127</name>
               <description>65 to 127 Byte Frames Transmitted Register</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>65 to 127 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFT255</name>
               <description>128 to 255 Byte Frames Transmitted Register</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>128 to 255 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFT511</name>
               <description>256 to 511 Byte Frames Transmitted Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>256 to 511 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFT1023</name>
               <description>512 to 1023 Byte Frames Transmitted Register</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>512 to 1023 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFT1518</name>
               <description>1024 to 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x12C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>1024 to 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_GTBFT1518</name>
               <description>Greater Than 1518 Byte Frames Transmitted Register</description>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFTX</name>
                     <description>Greater than 1518 Byte Frames Transmitted without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TUR</name>
               <description>Transmit Underruns Register</description>
               <addressOffset>0x134</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXUNR</name>
                     <description>Transmit Underruns</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_SCF</name>
               <description>Single Collision Frames Register</description>
               <addressOffset>0x138</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SCOL</name>
                     <description>Single Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_MCF</name>
               <description>Multiple Collision Frames Register</description>
               <addressOffset>0x13C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MCOL</name>
                     <description>Multiple Collision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_EC</name>
               <description>Excessive Collisions Register</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>XCOL</name>
                     <description>Excessive Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_LC</name>
               <description>Late Collisions Register</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LCOL</name>
                     <description>Late Collisions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_DTF</name>
               <description>Deferred Transmission Frames Register</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEFT</name>
                     <description>Deferred Transmission</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_CSE</name>
               <description>Carrier Sense Errors Register</description>
               <addressOffset>0x14C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CSR</name>
                     <description>Carrier Sense Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ORLO</name>
               <description>Octets Received Low Received Register</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXO</name>
                     <description>Received Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ORHI</name>
               <description>Octets Received High Received Register</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXO</name>
                     <description>Received Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_FR</name>
               <description>Frames Received Register</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FRX</name>
                     <description>Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_BCFR</name>
               <description>Broadcast Frames Received Register</description>
               <addressOffset>0x15C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BFRX</name>
                     <description>Broadcast Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_MFR</name>
               <description>Multicast Frames Received Register</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFRX</name>
                     <description>Multicast Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PFR</name>
               <description>Pause Frames Received Register</description>
               <addressOffset>0x164</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PFRX</name>
                     <description>Pause Frames Received Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_BFR64</name>
               <description>64 Byte Frames Received Register</description>
               <addressOffset>0x168</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>64 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFR127</name>
               <description>65 to 127 Byte Frames Received Register</description>
               <addressOffset>0x16C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>65 to 127 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFR255</name>
               <description>128 to 255 Byte Frames Received Register</description>
               <addressOffset>0x170</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>128 to 255 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFR511</name>
               <description>256 to 511 Byte Frames Received Register</description>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>256 to 511 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFR1023</name>
               <description>512 to 1023 Byte Frames Received Register</description>
               <addressOffset>0x178</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>512 to 1023 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TBFR1518</name>
               <description>1024 to 1518 Byte Frames Received Register</description>
               <addressOffset>0x17C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>1024 to 1518 Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TMXBFR</name>
               <description>1519 to Maximum Byte Frames Received Register</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NFRX</name>
                     <description>1519 to Maximum Byte Frames Received without Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
