cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71J20B.svd
            <register>
               <name>GMAC_UFR</name>
               <description>Undersize Frames Received Register</description>
               <addressOffset>0x184</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UFRX</name>
                     <description>Undersize Frames Received</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_OFR</name>
               <description>Oversize Frames Received Register</description>
               <addressOffset>0x188</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OFRX</name>
                     <description>Oversized Frames Received</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_JR</name>
               <description>Jabbers Received Register</description>
               <addressOffset>0x18C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>JRX</name>
                     <description>Jabbers Received</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_FCSE</name>
               <description>Frame Check Sequence Errors Register</description>
               <addressOffset>0x190</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FCKR</name>
                     <description>Frame Check Sequence Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_LFFE</name>
               <description>Length Field Frame Errors Register</description>
               <addressOffset>0x194</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LFER</name>
                     <description>Length Field Frame Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_RSE</name>
               <description>Receive Symbol Errors Register</description>
               <addressOffset>0x198</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXSE</name>
                     <description>Receive Symbol Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_AE</name>
               <description>Alignment Errors Register</description>
               <addressOffset>0x19C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>AER</name>
                     <description>Alignment Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_RRE</name>
               <description>Receive Resource Errors Register</description>
               <addressOffset>0x1A0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRER</name>
                     <description>Receive Resource Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_ROE</name>
               <description>Receive Overrun Register</description>
               <addressOffset>0x1A4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXOVR</name>
                     <description>Receive Overruns</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_IHCE</name>
               <description>IP Header Checksum Errors Register</description>
               <addressOffset>0x1A8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>HCKER</name>
                     <description>IP Header Checksum Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TCE</name>
               <description>TCP Checksum Errors Register</description>
               <addressOffset>0x1AC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCKER</name>
                     <description>TCP Checksum Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_UCE</name>
               <description>UDP Checksum Errors Register</description>
               <addressOffset>0x1B0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UCKER</name>
                     <description>UDP Checksum Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TISUBN</name>
               <description>1588 Timer Increment Sub-nanoseconds Register</description>
               <addressOffset>0x1BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LSBTIR</name>
                     <description>Lower Significant Bits of Timer Increment Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TSH</name>
               <description>1588 Timer Seconds High Register</description>
               <addressOffset>0x1C0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCS</name>
                     <description>Timer Count in Seconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TSL</name>
               <description>1588 Timer Seconds Low Register</description>
               <addressOffset>0x1D0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCS</name>
                     <description>Timer Count in Seconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TN</name>
               <description>1588 Timer Nanoseconds Register</description>
               <addressOffset>0x1D4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TNS</name>
                     <description>Timer Count in Nanoseconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TA</name>
               <description>1588 Timer Adjust Register</description>
               <addressOffset>0x1D8</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ITDT</name>
                     <description>Increment/Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
                  <field>
                     <name>ADJ</name>
                     <description>Adjust 1588 Timer</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TI</name>
               <description>1588 Timer Increment Register</description>
               <addressOffset>0x1DC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CNS</name>
                     <description>Count Nanoseconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACNS</name>
                     <description>Alternative Count Nanoseconds</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NIT</name>
                     <description>Number of Increments</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_EFTSL</name>
               <description>PTP Event Frame Transmitted Seconds Low Register</description>
               <addressOffset>0x1E0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_EFTN</name>
               <description>PTP Event Frame Transmitted Nanoseconds Register</description>
               <addressOffset>0x1E4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_EFRSL</name>
               <description>PTP Event Frame Received Seconds Low Register</description>
               <addressOffset>0x1E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_EFRN</name>
               <description>PTP Event Frame Received Nanoseconds Register</description>
               <addressOffset>0x1EC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PEFTSL</name>
               <description>PTP Peer Event Frame Transmitted Seconds Low Register</description>
               <addressOffset>0x1F0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PEFTN</name>
               <description>PTP Peer Event Frame Transmitted Nanoseconds Register</description>
               <addressOffset>0x1F4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PEFRSL</name>
               <description>PTP Peer Event Frame Received Seconds Low Register</description>
               <addressOffset>0x1F8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_PEFRN</name>
               <description>PTP Peer Event Frame Received Nanoseconds Register</description>
               <addressOffset>0x1FC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_RXLPI</name>
               <description>Received LPI Transitions</description>
               <addressOffset>0x270</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Count of RX LPI transitions (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_RXLPITIME</name>
               <description>Received LPI Time</description>
               <addressOffset>0x274</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LPITIME</name>
                     <description>Time in LPI (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TXLPI</name>
               <description>Transmit LPI Transitions</description>
               <addressOffset>0x278</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Count of LPI transitions (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_TXLPITIME</name>
               <description>Transmit LPI Time</description>
               <addressOffset>0x27C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LPITIME</name>
                     <description>Time in LPI (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_ISRPQ</name>
               <description>Interrupt Status Register Priority Queue (index = 1) 0</description>
               <addressOffset>0x3FC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to AHB Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_TBQBAPQ</name>
               <description>Transmit Buffer Queue Base Address Register Priority Queue (index = 1) 0</description>
               <addressOffset>0x43C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXBQBA</name>
                     <description>Transmit Buffer Queue Base Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_RBQBAPQ</name>
               <description>Receive Buffer Queue Base Address Register Priority Queue (index = 1) 0</description>
               <addressOffset>0x47C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RXBQBA</name>
                     <description>Receive Buffer Queue Base Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>GMAC_RBSRPQ</name>
               <description>Receive Buffer Size Register Priority Queue (index = 1) 0</description>
               <addressOffset>0x49C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RBS</name>
                     <description>Receive Buffer Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_CBSCR</name>
               <description>Credit-Based Shaping Control Register</description>
               <addressOffset>0x4BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>QBE</name>
                     <description>Queue B CBS Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QAE</name>
                     <description>Queue A CBS Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GMAC_CBSISQA</name>
               <description>Credit-Based Shaping IdleSlope Register for Queue A</description>
               <addressOffset>0x4C0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IS</name>
                     <description>IdleSlope</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
