cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71J20B.svd
            <register>
               <name>NVICIP22</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000316</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI22</name>
                     <description>Priority of interrupt 22</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP23</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000317</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI23</name>
                     <description>Priority of interrupt 23</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP24</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000318</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI24</name>
                     <description>Priority of interrupt 24</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP25</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000319</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI25</name>
                     <description>Priority of interrupt 25</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP26</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000031a</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI26</name>
                     <description>Priority of interrupt 26</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP27</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000031b</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI27</name>
                     <description>Priority of interrupt 27</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP28</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000031c</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI28</name>
                     <description>Priority of interrupt 28</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP29</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000031d</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI29</name>
                     <description>Priority of interrupt 29</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP30</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000031e</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI30</name>
                     <description>Priority of interrupt 30</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP31</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000031f</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI31</name>
                     <description>Priority of interrupt 31</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP32</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000320</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI32</name>
                     <description>Priority of interrupt 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP33</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000321</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI33</name>
                     <description>Priority of interrupt 33</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP34</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000322</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI34</name>
                     <description>Priority of interrupt 34</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP35</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000323</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI35</name>
                     <description>Priority of interrupt 35</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP36</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000324</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI36</name>
                     <description>Priority of interrupt 36</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP37</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000325</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI37</name>
                     <description>Priority of interrupt 37</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP38</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000326</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI38</name>
                     <description>Priority of interrupt 38</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP39</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000327</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI39</name>
                     <description>Priority of interrupt 39</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP40</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000328</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI40</name>
                     <description>Priority of interrupt 40</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP41</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000329</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI41</name>
                     <description>Priority of interrupt 41</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP42</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000032a</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI42</name>
                     <description>Priority of interrupt 42</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP43</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000032b</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI43</name>
                     <description>Priority of interrupt 43</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP44</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000032c</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI44</name>
                     <description>Priority of interrupt 44</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP45</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000032d</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI45</name>
                     <description>Priority of interrupt 45</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP46</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000032e</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI46</name>
                     <description>Priority of interrupt 46</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP47</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000032f</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI47</name>
                     <description>Priority of interrupt 47</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP48</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000330</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI48</name>
                     <description>Priority of interrupt 48</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP49</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000331</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI49</name>
                     <description>Priority of interrupt 49</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP50</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000332</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI50</name>
                     <description>Priority of interrupt 50</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP51</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000333</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI51</name>
                     <description>Priority of interrupt 51</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP52</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000334</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI52</name>
                     <description>Priority of interrupt 52</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP53</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000335</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI53</name>
                     <description>Priority of interrupt 53</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP54</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000336</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI54</name>
                     <description>Priority of interrupt 54</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP55</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000337</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI55</name>
                     <description>Priority of interrupt 55</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP56</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000338</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI56</name>
                     <description>Priority of interrupt 56</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP57</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000339</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI57</name>
                     <description>Priority of interrupt 57</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP58</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033a</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI58</name>
                     <description>Priority of interrupt 58</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP59</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033b</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI59</name>
                     <description>Priority of interrupt 59</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP60</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033c</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI60</name>
                     <description>Priority of interrupt 60</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP61</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033d</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI61</name>
                     <description>Priority of interrupt 61</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP62</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033e</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI62</name>
                     <description>Priority of interrupt 62</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP63</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000033f</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI63</name>
                     <description>Priority of interrupt 63</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP64</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000340</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>PRI64</name>
                     <description>Priority of interrupt 64</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
